//=============================================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author : GP11A132 16 朱暁テイ
//
//=============================================================================
#pragma once


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);
int GetResultTutorial(void);

